cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'wget'
# brew 'yt-dlp'

# cask 'airtable'
# cask 'arq'
# cask 'handbrake'
# cask 'messenger'
cask 'notion-calendar'
cask 'plex'
cask '1password'
cask 'adium'
cask 'firefox'
cask 'garmin-express'
cask 'google-chrome'
cask 'handbrake'
cask 'notion-calendar'
cask 'plex'
cask 'sonos'
cask 'transmission'
cask 'raycast'
cask 'warp'
cask 'visual-studio-code'
cask 'vlc'
