cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
# brew 'cloudflared'
# brew 'imagemagick'
brew 'postgresql@14'
brew 'redis'
# brew 'ruby-build'
# brew 'spaceman-diff'
# brew 'spark'
brew 'stripe/stripe-cli/stripe'
brew 'wget'
# brew 'yt-dlp'

# cask 'airtable'
# cask 'arq'
# cask 'handbrake'
# cask 'messenger'
<<<<<<< HEAD
cask 'notion-calendar'
cask 'plex'
cask '1password'
cask 'adium'
cask 'firefox'
cask 'garmin-express'
cask 'google-chrome'
cask 'handbrake'
cask 'messenger'
=======
>>>>>>> f4a70c2 (initial commit)
cask 'notion-calendar'
cask 'plex'
# cask 'sonos'
cask 'transmission'
# cask 'raycast'
# cask 'warp'
cask 'whatsapp'
cask 'visual-studio-code'
cask 'vlc'
# cask 'zed'
# Install GnuPG to enable PGP-signing commits.
brew install gnupg
# Install more recent versions of some macOS tools.
brew install vim --with-override-system-vi
brew install grep
brew install openssh
brew install screen
brew install php
brew install gmp
# Install font tools.
brew tap bramstein/webfonttools
brew install sfnt2woff
brew install sfnt2woff-zopfli
brew install woff2
brew install ack
#brew install exiv2
brew install git
brew install git-lfs
brew install gs
brew install imagemagick --with-webp
brew install lua
brew install lynx
brew install p7zip
brew install pigz
brew install pv
brew install rename
brew install rlwrap
brew install ssh-copy-id
brew install tree
brew install vbindiff
brew install zopfli

brew install openvpn
brew install slack
brew install google-chrome
brew install android-file-transfer
brew install postman
brew install android-studio
brew install drawio
brew install docker
brew install dbeaver-community
brew install figma
brew install flux
brew install iterm2
brew install notion

# Remove outdated versions from the cellar.
brew cleanup
